BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega1609.PIC
        <edc:SFRDef edc:_addr="0x4B7" edc:access="n---nnnn" edc:cname="PIN7CTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTF">
              <edc:SFRFieldDef edc:cname="ISC" edc:desc="Input/Sense Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled but input buffer enabled" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="BOTHEDGES" edc:desc="Sense Both Edges" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense Rising Edge" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense Falling Edge" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="INPUT_DISABLE" edc:desc="Digital Input Buffer disabled" edc:when="(field &amp; 0x7) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="LEVEL" edc:desc="Sense low Level" edc:when="(field &amp; 0x7) == 0x5"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PULLUPEN" edc:desc="Pullup enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INVEN" edc:desc="Inverted I/O Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x4B8" edc:offset="0x128"/>
        <edc:SFRDef edc:_addr="0x5E0" edc:access="--nnnnnn" edc:cname="EVSYSROUTEA" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="EVOUT0" edc:desc="Event Output 0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EVOUT1" edc:desc="Event Output 1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EVOUT2" edc:desc="Event Output 2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EVOUT3" edc:desc="Event Output 3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EVOUT4" edc:desc="Event Output 4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EVOUT5" edc:desc="Event Output 5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E1" edc:access="----nnnn" edc:cname="CCLROUTEA" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="LUT0" edc:desc="CCL LUT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LUT1" edc:desc="CCL LUT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LUT2" edc:desc="CCL LUT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LUT3" edc:desc="CCL LUT3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E2" edc:access="nnnnnnnn" edc:cname="USARTROUTEA" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="USART0" edc:desc="Port Multiplexer USART0" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="USART0 on PA[3:0]" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="USART0 on PA[7:4]" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="USART1" edc:desc="Port Multiplexer USART1" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="USART1 on PC[3:0]" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="USART1 on PC[7:4]" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="USART2" edc:desc="Port Multiplexer USART2" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="USART2 on PF[3:0]" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="USART2 on PF[6:4]" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="USART3" edc:desc="Port Multiplexer USART3" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="USART3 on PB[3:0]" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="USART3 on PB[5:4]" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E3" edc:access="--nn--nn" edc:cname="TWISPIROUTEA" edc:impl="0x33" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="SPI0" edc:desc="Port Multiplexer SPI0" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="SPI0 on PA[7:4]" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="SPI0 on PC[3:0]" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="ALT2" edc:desc="SPI0 on PE[3:0]" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TWI0" edc:desc="Port Multiplexer TWI0" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="SCL/SDA on PA[3:2], Slave mode on PC[3:2] in dual TWI mode" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="SCL/SDA on PA[3:2], Slave mode on PF[3:2] in dual TWI mode" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="ALT2" edc:desc="SCL/SDA on PC[3:2], Slave mode on PF[3:2] in dual TWI mode" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E4" edc:access="-----nnn" edc:cname="TCAROUTEA" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="TCA0" edc:desc="Port Multiplexer TCA0" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="PORTA" edc:desc="TCA0 pins on PA[5:0]" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="PORTB" edc:desc="TCA0 pins on PB[5:0]" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="PORTC" edc:desc="TCA0 pins on PC[5:0]" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="PORTD" edc:desc="TCA0 pins on PD[5:0]" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="PORTE" edc:desc="TCA0 pins on PE[5:0]" edc:when="(field &amp; 0x7) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="PORTF" edc:desc="TCA0 pins on PF[5:0]" edc:when="(field &amp; 0x7) == 0x5"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
