BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega1609.PIC
        <edc:SFRDef edc:_addr="0x1001" edc:access="------nn" edc:cname="CTRLB" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="APCWP" edc:desc="Application code write protect" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOOTLOCK" edc:desc="Boot Lock" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1002" edc:access="-----rrr" edc:cname="STATUS" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="FBUSY" edc:desc="Flash busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEBUSY" edc:desc="EEPROM busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRERROR" edc:desc="Write error" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1003" edc:access="-------n" edc:cname="INTCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="EEREADY" edc:desc="EEPROM Ready" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1004" edc:access="-------n" edc:cname="INTFLAGS" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="EEREADY" edc:desc="EEPROM Ready" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x1005" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x1006" edc:access="nnnnnnnnnnnnnnnn" edc:cname="DATA" edc:nzwidth="0x10" ltx:memberofperipheral="NVMCTRL"/>
        <edc:SFRDef edc:_addr="0x1008" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADDR" edc:nzwidth="0x10" ltx:memberofperipheral="NVMCTRL"/>
      </edc:SFRDataSector>
      <edc:ConfigFuseSector atdf:pagesize="0x20" edc:beginaddr="0x128A" edc:endaddr="0x128B" edc:magicoffset="0x830000" edc:regionid="LOCKBITS">
        <edc:DCRDef edc:_addr="0x128A" edc:access="nnnnnnnn" edc:cname="LOCKBIT" edc:factorydefault="0xC5" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="LOCKBIT">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCKBIT">
              <edc:DCRFieldDef edc:cname="LB" edc:desc="Lock Bits" edc:nzwidth="0x8">
                <edc:DCRFieldSemantic edc:cname="RWLOCK" edc:desc="Read and write lock" edc:when="(field &amp; 0xFF) == 0x3A"/>
                <edc:DCRFieldSemantic edc:cname="NOLOCK" edc:desc="No locks" edc:when="(field &amp; 0xFF) == 0xC5"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
      </edc:ConfigFuseSector>
      <edc:DeviceIDSector atdf:pagesize="0x40" edc:beginaddr="0x1103" edc:endaddr="0x1140" edc:regionid="PROD_SIGNATURES" edc:value="0x1E9426">
        <edc:DCRDef edc:_addr="0x1103" edc:access="rrrrrrrr" edc:cname="SERNUM0" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1104" edc:access="rrrrrrrr" edc:cname="SERNUM1" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1105" edc:access="rrrrrrrr" edc:cname="SERNUM2" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1106" edc:access="rrrrrrrr" edc:cname="SERNUM3" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1107" edc:access="rrrrrrrr" edc:cname="SERNUM4" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1108" edc:access="rrrrrrrr" edc:cname="SERNUM5" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1109" edc:access="rrrrrrrr" edc:cname="SERNUM6" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x110A" edc:access="rrrrrrrr" edc:cname="SERNUM7" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x110B" edc:access="rrrrrrrr" edc:cname="SERNUM8" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x110C" edc:access="rrrrrrrr" edc:cname="SERNUM9" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:AdjustPoint edc:_addr="0x110D" edc:offset="0x7"/>
        <edc:DCRDef edc:_addr="0x1114" edc:access="rrrrrrrr" edc:cname="OSCCAL32K" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:AdjustPoint edc:_addr="0x1115" edc:offset="0x3"/>
        <edc:DCRDef edc:_addr="0x1118" edc:access="rrrrrrrr" edc:cname="OSCCAL16M0" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1119" edc:access="rrrrrrrr" edc:cname="OSCCAL16M1" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x111A" edc:access="rrrrrrrr" edc:cname="OSCCAL20M0" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x111B" edc:access="rrrrrrrr" edc:cname="OSCCAL20M1" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:AdjustPoint edc:_addr="0x111C" edc:offset="0x4"/>
        <edc:DCRDef edc:_addr="0x1120" edc:access="rrrrrrrr" edc:cname="TEMPSENSE0" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1121" edc:access="rrrrrrrr" edc:cname="TEMPSENSE1" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1122" edc:access="rrrrrrrr" edc:cname="OSC16ERR3V" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1123" edc:access="rrrrrrrr" edc:cname="OSC16ERR5V" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1124" edc:access="rrrrrrrr" edc:cname="OSC20ERR3V" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1125" edc:access="rrrrrrrr" edc:cname="OSC20ERR5V" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:AdjustPoint edc:_addr="0x1126" edc:offset="0x9"/>
        <edc:DCRDef edc:_addr="0x112F" edc:access="rrrrrrrr" edc:cname="CHECKSUM1" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
      </edc:DeviceIDSector>
      <edc:DeviceIDSector atdf:pagesize="0x40" edc:beginaddr="0x1100" edc:endaddr="0x1103" edc:regionid="SIGNATURES" edc:value="0x1E9426">
        <edc:DCRDef edc:_addr="0x1100" edc:access="rrrrrrrr" edc:cname="DEVICEID0" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1101" edc:access="rrrrrrrr" edc:cname="DEVICEID1" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1102" edc:access="rrrrrrrr" edc:cname="DEVICEID2" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
      </edc:DeviceIDSector>
    </edc:RegardlessOfMode>
    <edc:RegisterMap edc:id="TCA0/SPLIT">
      <edc:SFRDef edc:access="----nnnn" edc:addr="0xA00" edc:cname="CTRLA" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Module Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="System Clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="System Clock / 2" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="System Clock / 4" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="System Clock / 8" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="System Clock / 16" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="System Clock / 64" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="System Clock / 256" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="System Clock / 1024" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA20" edc:cname="LCNT" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-nnn-nnn" edc:addr="0xA01" edc:cname="CTRLB" edc:impl="0x77" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="LCMP0EN" edc:desc="Low Compare 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP1EN" edc:desc="Low Compare 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP2EN" edc:desc="Low Compare 2 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP0EN" edc:desc="High Compare 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP1EN" edc:desc="High Compare 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP2EN" edc:desc="High Compare 2 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA21" edc:cname="HCNT" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-nnn-nnn" edc:addr="0xA02" edc:cname="CTRLC" edc:impl="0x77" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="LCMP0OV" edc:desc="Low Compare 0 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP1OV" edc:desc="Low Compare 1 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP2OV" edc:desc="Low Compare 2 Output Value" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP0OV" edc:desc="High Compare 0 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP1OV" edc:desc="High Compare 1 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP2OV" edc:desc="High Compare 2 Output Value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------n" edc:addr="0xA03" edc:cname="CTRLD" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="SPLITM" edc:desc="Split Mode Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nn--" edc:addr="0xA04" edc:cname="CTRLECLR" edc:impl="0xC" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Command" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force Update" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RESTART" edc:desc="Force Restart" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="Force Hard Reset" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nn--" edc:addr="0xA05" edc:cname="CTRLESET" edc:impl="0xC" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Command" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force Update" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RESTART" edc:desc="Force Restart" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="Force Hard Reset" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA26" edc:cname="LPER" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA27" edc:cname="HPER" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA28" edc:cname="LCMP0" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA29" edc:cname="HCMP0" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-nnn--nn" edc:addr="0xA0A" edc:cname="INTCTRL" edc:impl="0x73" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="LUNF" edc:desc="Low Underflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HUNF" edc:desc="High Underflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LCMP0" edc:desc="Low Compare 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP1" edc:desc="Low Compare 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP2" edc:desc="Low Compare 2 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA2A" edc:cname="LCMP1" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA2B" edc:cname="HCMP1" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-nnn--nn" edc:addr="0xA0B" edc:cname="INTFLAGS" edc:impl="0x73" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="LUNF" edc:desc="Low Underflow Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HUNF" edc:desc="High Underflow Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LCMP0" edc:desc="Low Compare 2 Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP1" edc:desc="Low Compare 1 Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP2" edc:desc="Low Compare 0 Interrupt Flag" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA2C" edc:cname="LCMP2" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA2D" edc:cname="HCMP2" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-------n" edc:addr="0xA0E" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="TCA0/SINGLE">
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA20" edc:cname="CNT" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="----nnnn" edc:addr="0xA00" edc:cname="CTRLA" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Module Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="System Clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="System Clock / 2" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="System Clock / 4" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="System Clock / 8" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="System Clock / 16" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="System Clock / 64" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="System Clock / 256" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="System Clock / 1024" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnn" edc:addr="0xA01" edc:cname="CTRLB" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="WGMODE" edc:desc="Waveform generation mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal Mode" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FRQ" edc:desc="Frequency Generation Mode" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPE" edc:desc="Single Slope PWM" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DSTOP" edc:desc="Dual Slope PWM, overflow on TOP" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DSBOTH" edc:desc="Dual Slope PWM, overflow on TOP and BOTTOM" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DSBOTTOM" edc:desc="Dual Slope PWM, overflow on BOTTOM" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALUPD" edc:desc="Auto Lock Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP0EN" edc:desc="Compare 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1EN" edc:desc="Compare 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2EN" edc:desc="Compare 2 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----nnn" edc:addr="0xA02" edc:cname="CTRLC" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="CMP0OV" edc:desc="Compare 0 Waveform Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1OV" edc:desc="Compare 1 Waveform Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2OV" edc:desc="Compare 2 Waveform Output Value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------n" edc:addr="0xA03" edc:cname="CTRLD" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="SPLITM" edc:desc="Split Mode Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
